Revit 2024 API
BuiltInFailures.StructuralLoadFailures.CannotMoveBoundaryCondition Property
 Can't move Boundary Conditions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMoveBoundaryCondition { get; }
Visual Basic
Public Shared ReadOnly Property CannotMoveBoundaryCondition As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMoveBoundaryCondition {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralLoadFailures Class
Autodesk.Revit.DB Namespace